<template>
    <div>我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件我是分页器组件</div>
    <Pagejump :last-page="{ route: '/doc/layout', content: 'Layout 组件' }"/>
</template>

<script lang="ts">
    import Pagejump from "../../components/Pagejump/index.vue";

    export default {
        components: {Pagejump}
    };
</script>

<style lang="scss" scoped>

</style>